<p><font size="6"><b>03 - Pandas: Indexing and selecting data - part I</b></font></p>

Adapted version from:
> *Â© 2021, Joris Van den Bossche and Stijn Van Hoey  (<mailto:jorisvandenbossche@gmail.com>, <mailto:stijnvanhoey@gmail.com>). Licensed under [CC BY 4.0 Creative Commons](http://creativecommons.org/licenses/by/4.0/)*

---

In [4]:
import pandas as pd

In [3]:
# redefining the example DataFrame

data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries = pd.DataFrame(data)
countries

          country  population    area    capital
0         Belgium        11.3   30510   Brussels
1          France        64.3  671308      Paris
2         Germany        81.3  357050     Berlin
3     Netherlands        16.9   41526  Amsterdam
4  United Kingdom        64.9  244820     London

# Subsetting data

## Subset variables (columns)

For a DataFrame, basic indexing selects the columns (cfr. the dictionaries of pure python)

Selecting a **single column**:

In [4]:
countries['area'] # single []

0     30510
1    671308
2    357050
3     41526
4    244820
Name: area, dtype: int64

Remember that the same syntax can also be used to *add* a new columns: `df['new'] = ...`.

We can also select **multiple columns** by passing a list of column names into `[]`:

In [5]:
countries[['area', 'population']] # double [[]]

     area  population
0   30510        11.3
1  671308        64.3
2  357050        81.3
3   41526        16.9
4  244820        64.9

## Subset observations (rows)

Using `[]`, slicing or boolean indexing accesses the **rows**:

### Slicing

In [6]:
countries[0:4]

       country  population    area    capital
0      Belgium        11.3   30510   Brussels
1       France        64.3  671308      Paris
2      Germany        81.3  357050     Berlin
3  Netherlands        16.9   41526  Amsterdam

### Boolean indexing (filtering)

Often, you want to select rows based on a certain condition. This can be done with *'boolean indexing'* (like a where clause in SQL) and comparable to numpy. 

The indexer (or boolean mask) should be 1-dimensional and the same length as the thing being indexed.

In [7]:
countries['area'] > 100000

0    False
1     True
2     True
3    False
4     True
Name: area, dtype: bool

In [8]:
countries[countries['area'] > 100000]

          country  population    area capital
1          France        64.3  671308   Paris
2         Germany        81.3  357050  Berlin
4  United Kingdom        64.9  244820  London

In [9]:
countries[countries['population'] > 50]

          country  population    area capital
1          France        64.3  671308   Paris
2         Germany        81.3  357050  Berlin
4  United Kingdom        64.9  244820  London

An overview of the possible comparison operations:

Operator   |  Description
------ | --------
==       | Equal
!=       | Not equal
\>       | Greater than
\>=       | Greater than or equal
\<       | Lesser than
<=       | Lesser than or equal

and to combine multiple conditions:

Operator   |  Description
------ | --------
&       | And (`cond1 & cond2`)
\|       | Or (`cond1 \| cond2`)

<div class="alert alert-info" style="font-size:120%">
<b>REMEMBER</b>: <br><br>

So as a summary, `[]` provides the following convenience shortcuts:

* **Series**: selecting a **label**: `s[label]`
* **DataFrame**: selecting a single or multiple **columns**:`df['col']` or `df[['col1', 'col2']]`
* **DataFrame**: slicing or filtering the **rows**: `df['row_label1':'row_label2']` or `df[mask]`

</div>

## Some other useful methods: `isin` and `string` methods

The `isin` method of Series is very useful to select rows that may contain certain values:

In [10]:
s = countries['capital']

In [11]:
s.isin?

In [12]:
s.isin(['Berlin', 'London'])

0    False
1    False
2     True
3    False
4     True
Name: capital, dtype: bool

This can then be used to filter the dataframe with boolean indexing:

In [13]:
countries[countries['capital'].isin(['Berlin', 'London'])]

          country  population    area capital
2         Germany        81.3  357050  Berlin
4  United Kingdom        64.9  244820  London

Let's say we want to select all data for which the capital starts with a 'B'. In Python, when having a string, we could use the `startswith` method:

In [14]:
string = 'Berlin'

In [15]:
string.startswith('B')

True

In pandas, these are available on a Series through the `str` namespace:

In [16]:
countries['capital'].str.startswith('B')

0     True
1    False
2     True
3    False
4    False
Name: capital, dtype: bool

For an overview of all string methods, see: https://pandas.pydata.org/pandas-docs/stable/reference/series.html#string-handling

# Exercises using the Titanic dataset

In [6]:
df = pd.read_csv("data/titanic.csv")

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<div class="alert alert-success">

<b>EXERCISE 1</b>:

 <ul>
  <li>Select all rows for male passengers and calculate the mean age of those passengers. Do the same for the female passengers.</li>
</ul>
</div>

In [16]:
# %load _solutions/pandas_03a_selecting_data1.py

In [19]:
# %load _solutions/pandas_03a_selecting_data2.py

In [20]:
# %load _solutions/pandas_03a_selecting_data3.py

We will later see an easier way to calculate both averages at the same time with groupby.

<div class="alert alert-success">

<b>EXERCISE 2</b>:

 <ul>
  <li>How many passengers older than 70 were on the Titanic?</li>
</ul>
</div>

In [26]:
# %load _solutions/pandas_03a_selecting_data4.py
len(df[df['Age'] > 70])

5

In [27]:
# %load _solutions/pandas_03a_selecting_data5.py
(df['Age'] > 70).sum()

<div class="alert alert-success">

<b>EXERCISE 3</b>:

 <ul>
  <li>Select the passengers that are between 30 and 40 years old?</li>
</ul>
</div>

In [31]:
# %load _solutions/pandas_03a_selecting_data6.py
df[(df['Age'] > 30) & (df['Age'] <= 40)]

142

<div class="alert alert-success">

<b>EXERCISE 4</b>:

For a single string `name = 'Braund, Mr. Owen Harris'`, split this string (check the `split()` method of a string) and get the first element of the resulting list.
    
<details><summary>Hints</summary>

- No Pandas in this exercise, just standard Python.
- The `split()` method of a string returns a python list. Accessing elements of a python list can be done using the square brackets indexing (`a_list[i]`).
    
</details> 

</div>

In [ ]:
name = 'Braund, Mr. Owen Harris'

In [ ]:
# %load _solutions/pandas_03a_selecting_data7.py

<div class="alert alert-success">

<b>EXERCISE 5</b>:
    
Convert the solution of the previous exercise to all strings of the `Name` column at once. Split the 'Name' column on the `,`, extract the first part (the surname), and add this as new column 'Surname'. 
    
<details><summary>Hints</summary>

- Pandas uses the `str` accessor to use the string methods such as `split`, e.g. `.str.split(...)` as the equivalent of the `split()` method of a single string (note: there is a small difference in the naming of the first keyword argument: `sep` vs `pat`).
- The [`.str.get()`](https://pandas.pydata.org/docs/reference/api/pandas.Series.str.get.html#pandas.Series.str.get) can be used to get the n-th element of a list, which is what the `str.split()` returns. This is the equivalent of selecting an element of a single list (`a_list[i]`) but then for all values of the Series.
- One can chain multiple `.str` methods, e.g. `str.SOMEMETHOD(...).str.SOMEOTHERMETHOD(...)`.
    
</details>    

</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data8.py

<div class="alert alert-success">

<b>EXERCISE 6</b>:

 <ul>
  <li>Select all passenger that have a surname starting with 'Williams'.</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data9.py

<div class="alert alert-success">

<b>EXERCISE 7</b>:

 <ul>
  <li>Select all rows for the passengers with a surname of more than 15 characters.</li>
</ul>
    
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data10.py

# [OPTIONAL] more exercises

For the quick ones among you, here are some more exercises with some larger dataframe with film data. These exercises are based on the [PyCon tutorial of Brandon Rhodes](https://github.com/brandon-rhodes/pycon-pandas-tutorial/) (so all credit to him!) and the datasets he prepared for that. You can download these data from here: [`titles.csv`](https://course-python-data.s3.eu-central-1.amazonaws.com/titles.csv) and [`cast.csv`](https://course-python-data.s3.eu-central-1.amazonaws.com/cast.csv) and put them in the `/notebooks/data` folder.

In [ ]:
cast = pd.read_csv('data/cast.csv')
cast.head()

In [ ]:
titles = pd.read_csv('data/titles.csv')
titles.head()

<div class="alert alert-success">

<b>EXERCISE 8</b>:

 <ul>
  <li>How many movies are listed in the titles dataframe?</li>
</ul>
    
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data11.py

<div class="alert alert-success">

<b>EXERCISE 9</b>:

 <ul>
  <li>What are the earliest two films listed in the titles dataframe?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data12.py

<div class="alert alert-success">

<b>EXERCISE 10</b>:

 <ul>
  <li>How many movies have the title "Hamlet"?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data13.py

<div class="alert alert-success">

<b>EXERCISE 11</b>:

 <ul>
  <li>List all of the "Treasure Island" movies from earliest to most recent.</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data14.py

<div class="alert alert-success">

<b>EXERCISE 12</b>:

 <ul>
  <li>How many movies were made from 1950 through 1959?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data15.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data16.py

<div class="alert alert-success">

<b>EXERCISE 13</b>:

 <ul>
  <li>How many roles in the movie "Inception" are NOT ranked by an "n" value?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data17.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data18.py

In [ ]:
# %load _solutions/pandas_03a_selecting_data19.py

<div class="alert alert-success">

<b>EXERCISE 14</b>:

 <ul>
  <li>But how many roles in the movie "Inception" did receive an "n" value?</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data20.py

<div class="alert alert-success">

<b>EXERCISE 15</b>:

 <ul>
  <li>Display the cast of the "Titanic" (the most famous 1997 one) in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data21.py

<div class="alert alert-success">

<b>EXERCISE 16</b>:

 <ul>
  <li>List the supporting roles (having n=2) played by Brad Pitt in the 1990s, in order by year.</li>
</ul>
</div>

In [ ]:
# %load _solutions/pandas_03a_selecting_data22.py

# Acknowledgement


> The optional exercises are based on the [PyCon tutorial of Brandon Rhodes](https://github.com/brandon-rhodes/pycon-pandas-tutorial/) (so all credit to him!) and the datasets he prepared for that.

---